tutorials/denseAGFoam/fluidizedBed/constant/quadratureProperties.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      quadratureProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fieldMomentInversion    basicFieldMomentInversion;

basicMomentInversion
{
    univariateMomentInversion   Gauss;
}

moments
(
    (0)
    (1)
    (2)
    (3)
);

nodes
(
    node0
    {}
    node1
    {}
);

residuals
{
    minM0   1;
    minM1   1e-6;
}
// ************************************************************************* //
