tutorials/denseAGFoam/fluidizedBed/0.org/U.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type                fixedValue;
        value               uniform (0 0 0);
    }
    outlet
    {
        type                inletOutlet;
        phi                 phi.particles;
        inletValue          uniform (0 0 0);
        value               $internalField;
    }
    inlet
    {
        type                fixedValue;
        value               uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type                empty;
    }
}

// ************************************************************************* //
